*> --- Copybook: callback parameters for item use ---

01 LK-PLAYER                BINARY-CHAR.
01 LK-ITEM-NAME             PIC X ANY LENGTH.
01 LK-POSITION.
    02 LK-POSITION-X        BINARY-LONG.
    02 LK-POSITION-Y        BINARY-LONG.
    02 LK-POSITION-Z        BINARY-LONG.
01 LK-FACE                  BINARY-LONG.
