*> --- Copybook: shared data for game registries ---
01 REGISTRIES EXTERNAL.
    02 REGISTRIES-COUNT BINARY-LONG UNSIGNED.
    02 REGISTRY OCCURS 100 TIMES.
        03 REGISTRY-NAME PIC X(100).
        03 REGISTRY-ID BINARY-LONG UNSIGNED.
        03 REGISTRY-ENTRIES-COUNT BINARY-LONG UNSIGNED.
        03 REGISTRY-ENTRY OCCURS 2000 TIMES.
            04 REGISTRY-ENTRY-NAME PIC X(100).
            04 REGISTRY-ENTRY-ID BINARY-LONG UNSIGNED.
