IDENTIFICATION DIVISION.
PROGRAM-ID. CodegenMain.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 DATADIR                  PIC X(256).
    01 OUTDIR                   PIC X(256).

PROCEDURE DIVISION CHAINING OPTIONAL DATADIR OPTIONAL OUTDIR.
    IF (DATADIR IS OMITTED OR DATADIR = SPACES) OR (OUTDIR IS OMITTED OR OUTDIR = SPACES)
        DISPLAY "Usage: codegen <datadir> <outdir>"
        STOP RUN RETURNING 1
    END-IF

    CALL "Codegen-BlocksLootTable" USING DATADIR OUTDIR

    STOP RUN.

END PROGRAM CodegenMain.
