IDENTIFICATION DIVISION.
PROGRAM-ID. Main.

DATA DIVISION.
WORKING-STORAGE SECTION.
    *> Configuration
    01 PORT             PIC X(5)    VALUE "25565".
    01 WHITELIST-ENABLE PIC 9(1)    VALUE 0.
    01 WHITELIST-PLAYER PIC X(16)   VALUE "Notch".

PROCEDURE DIVISION.
    CALL "Server" USING PORT WHITELIST-ENABLE WHITELIST-PLAYER.

END PROGRAM Main.
