*> --- Test: C++ functions ---
IDENTIFICATION DIVISION.
PROGRAM-ID. Test-CPP.

PROCEDURE DIVISION.
    COPY TEST-SUITE REPLACING ==NAME== BY =="C++ functions"==.
    CALL "Test-LeadingZeros32"
    CALL "Test-ZlibCompress"
    CALL "Test-ZlibDecompress"
    CALL "Test-GzipCompress"
    CALL "Test-GzipDecompress"
    GOBACK.

    *> --- Test: Test-LeadingZeros32 ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-LeadingZeros32.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     BINARY-LONG UNSIGNED.
        01 RESULT       BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Test-LeadingZeros32"==.
    Int0.
        COPY TEST-CASE REPLACING ==NAME== BY =="0"==.
        MOVE 0 TO VALUE-IN
        CALL "LeadingZeros32" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 32==.
    Int1.
        COPY TEST-CASE REPLACING ==NAME== BY =="1"==.
        MOVE 1 TO VALUE-IN
        CALL "LeadingZeros32" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 31==.
    Int2.
        COPY TEST-CASE REPLACING ==NAME== BY =="2"==.
        MOVE 2 TO VALUE-IN
        CALL "LeadingZeros32" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 30==.
    Int3.
        COPY TEST-CASE REPLACING ==NAME== BY =="3"==.
        MOVE 3 TO VALUE-IN
        CALL "LeadingZeros32" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 30==.
    IntMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="2^32-1"==.
        MOVE 4294967295 TO VALUE-IN
        CALL "LeadingZeros32" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 0==.

        GOBACK.

    END PROGRAM Test-LeadingZeros32.

    *> --- Test: Test-ZlibCompress ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-ZlibCompress.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 INPUT-BUFFER         PIC X(100).
        01 OUTPUT-BUFFER        PIC X(100).
        01 INPUT-LENGTH         BINARY-LONG UNSIGNED.
        01 OUTPUT-LENGTH        BINARY-LONG UNSIGNED.
        01 ERRNO                BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Test-ZlibCompress"==.
    Basic.
        COPY TEST-CASE REPLACING ==NAME== BY =="Basic"==.
        MOVE "Hello, World!" TO INPUT-BUFFER
        MOVE 13 TO INPUT-LENGTH
        MOVE SPACES TO OUTPUT-BUFFER
        MOVE LENGTH OF OUTPUT-BUFFER TO OUTPUT-LENGTH
        CALL "ZlibCompress" USING INPUT-BUFFER INPUT-LENGTH OUTPUT-BUFFER OUTPUT-LENGTH GIVING ERRNO
        COPY TEST-ASSERT REPLACING COND BY ==ERRNO = 0 AND OUTPUT-LENGTH = 21
            AND OUTPUT-BUFFER(1:21) = X"789CF348CDC9C9D75108CF2FCA495104001F9E046A"==.

        GOBACK.

    END PROGRAM Test-ZlibCompress.

    *> --- Test: Test-ZlibDecompress ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-ZlibDecompress.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 INPUT-BUFFER         PIC X(100).
        01 OUTPUT-BUFFER        PIC X(100).
        01 INPUT-LENGTH         BINARY-LONG UNSIGNED.
        01 OUTPUT-LENGTH        BINARY-LONG UNSIGNED.
        01 ERRNO                BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Test-ZlibDecompress"==.
    Basic.
        COPY TEST-CASE REPLACING ==NAME== BY =="Basic"==.
        MOVE X"789CF348CDC9C9D75108CF2FCA495104001F9E046A" TO INPUT-BUFFER
        MOVE 21 TO INPUT-LENGTH
        MOVE SPACES TO OUTPUT-BUFFER
        MOVE LENGTH OF OUTPUT-BUFFER TO OUTPUT-LENGTH
        CALL "ZlibDecompress" USING INPUT-BUFFER INPUT-LENGTH OUTPUT-BUFFER OUTPUT-LENGTH GIVING ERRNO
        COPY TEST-ASSERT REPLACING COND BY ==ERRNO = 0 AND OUTPUT-LENGTH = 13 AND OUTPUT-BUFFER(1:13) = "Hello, World!"==.

        GOBACK.

    END PROGRAM Test-ZlibDecompress.

    *> --- Test: Test-GzipCompress ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-GzipCompress.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 INPUT-BUFFER         PIC X(100).
        01 OUTPUT-BUFFER        PIC X(100).
        01 INPUT-LENGTH         BINARY-LONG UNSIGNED.
        01 OUTPUT-LENGTH        BINARY-LONG UNSIGNED.
        01 ERRNO                BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Test-GzipCompress"==.
    Basic.
        COPY TEST-CASE REPLACING ==NAME== BY =="Basic"==.
        MOVE "Hello, World!" TO INPUT-BUFFER
        MOVE 13 TO INPUT-LENGTH
        MOVE SPACES TO OUTPUT-BUFFER
        MOVE LENGTH OF OUTPUT-BUFFER TO OUTPUT-LENGTH
        CALL "GzipCompress" USING INPUT-BUFFER INPUT-LENGTH OUTPUT-BUFFER OUTPUT-LENGTH GIVING ERRNO
        COPY TEST-ASSERT REPLACING COND BY ==ERRNO = 0 AND OUTPUT-LENGTH = 33
            AND OUTPUT-BUFFER(1:33) = X"1F8B0800000000000003F348CDC9C9D75108CF2FCA49510400D0C34AEC0D000000"==.

        GOBACK.

    END PROGRAM Test-GzipCompress.

    *> --- Test: Test-GzipDecompress ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-GzipDecompress.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 INPUT-BUFFER         PIC X(100).
        01 OUTPUT-BUFFER        PIC X(100).
        01 INPUT-LENGTH         BINARY-LONG UNSIGNED.
        01 OUTPUT-LENGTH        BINARY-LONG UNSIGNED.
        01 ERRNO                BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Test-GzipDecompress"==.
    Basic.
        COPY TEST-CASE REPLACING ==NAME== BY =="Basic"==.
        MOVE X"1F8B0800000000000003F348CDC9C9D75108CF2FCA49510400D0C34AEC0D000000" TO INPUT-BUFFER
        MOVE 33 TO INPUT-LENGTH
        MOVE SPACES TO OUTPUT-BUFFER
        MOVE LENGTH OF OUTPUT-BUFFER TO OUTPUT-LENGTH
        CALL "GzipDecompress" USING INPUT-BUFFER INPUT-LENGTH OUTPUT-BUFFER OUTPUT-LENGTH GIVING ERRNO
        COPY TEST-ASSERT REPLACING COND BY ==ERRNO = 0 AND OUTPUT-LENGTH = 13 AND OUTPUT-BUFFER(1:13) = "Hello, World!"==.

        GOBACK.

    END PROGRAM Test-GzipDecompress.

END PROGRAM Test-CPP.
