IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-AckBlockChange.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PACKET-ID        BINARY-LONG             VALUE H'05'.
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(8).
    01 PAYLOADPOS       BINARY-LONG UNSIGNED.
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    01 LK-SEQUENCE-ID   BINARY-LONG.

PROCEDURE DIVISION USING LK-CLIENT LK-SEQUENCE-ID.
    MOVE 1 TO PAYLOADPOS

    *> sequence ID
    CALL "Encode-VarInt" USING LK-SEQUENCE-ID PAYLOAD PAYLOADPOS

    *> send packet
    COMPUTE PAYLOADLEN = PAYLOADPOS - 1
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-AckBlockChange.
