IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-BlockEntityData.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PACKET-ID        BINARY-LONG             VALUE H'07'.
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(64000).
    01 PAYLOADPOS       BINARY-LONG UNSIGNED.
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    01 LK-POSITION.
        02 LK-X         BINARY-LONG.
        02 LK-Y         BINARY-LONG.
        02 LK-Z         BINARY-LONG.
    01 LK-TYPE          BINARY-LONG.
    01 LK-NBT-DATA      PIC X ANY LENGTH.
    01 LK-NBT-LENGTH    BINARY-LONG UNSIGNED.

PROCEDURE DIVISION USING LK-CLIENT LK-POSITION LK-TYPE LK-NBT-DATA LK-NBT-LENGTH.
    MOVE 1 TO PAYLOADPOS

    *> location
    CALL "Encode-Position" USING LK-POSITION PAYLOAD PAYLOADPOS

    *> block entity type
    CALL "Encode-VarInt" USING LK-TYPE PAYLOAD PAYLOADPOS

    *> NBT data
    MOVE LK-NBT-DATA(1:LK-NBT-LENGTH) TO PAYLOAD(PAYLOADPOS:LK-NBT-LENGTH)
    ADD LK-NBT-LENGTH TO PAYLOADPOS

    *> send packet
    COMPUTE PAYLOADLEN = PAYLOADPOS - 1
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-BlockEntityData.
