IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-SetCenterChunk.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PACKET-ID        BINARY-LONG             VALUE H'58'.
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(16).
    01 PAYLOADPOS       BINARY-LONG UNSIGNED.
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    01 LK-CHUNK-X       BINARY-LONG.
    01 LK-CHUNK-Z       BINARY-LONG.

PROCEDURE DIVISION USING LK-CLIENT LK-CHUNK-X LK-CHUNK-Z.
    MOVE 1 TO PAYLOADPOS

    *> chunk coordinates
    CALL "Encode-VarInt" USING LK-CHUNK-X PAYLOAD PAYLOADPOS
    CALL "Encode-VarInt" USING LK-CHUNK-Z PAYLOAD PAYLOADPOS

    *> send packet
    COMPUTE PAYLOADLEN = PAYLOADPOS - 1
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-SetCenterChunk.
