IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-SetHeldItem.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PACKET-ID        BINARY-LONG             VALUE H'63'.
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(1).
    01 PAYLOADLEN       BINARY-LONG UNSIGNED    VALUE 1.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    01 LK-SLOT          BINARY-CHAR UNSIGNED.

PROCEDURE DIVISION USING LK-CLIENT LK-SLOT.
    MOVE FUNCTION CHAR(LK-SLOT + 1) TO PAYLOAD(1:1)
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-SetHeldItem.
