*> --- Copybook: callback parameters for block interaction ---

01 LK-PLAYER                BINARY-LONG.
01 LK-ITEM-NAME             PIC X ANY LENGTH.
01 LK-POSITION.
    02 LK-POSITION-X        BINARY-LONG.
    02 LK-POSITION-Y        BINARY-LONG.
    02 LK-POSITION-Z        BINARY-LONG.
01 LK-FACE                  BINARY-LONG.
01 LK-CURSOR.
    02 LK-CURSOR-X          FLOAT-SHORT.
    02 LK-CURSOR-Y          FLOAT-SHORT.
    02 LK-CURSOR-Z          FLOAT-SHORT.
