IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-BlockUpdate.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-PACKET REPLACING IDENTIFIER BY "play/clientbound/minecraft:block_update".
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(32).
    01 PAYLOADPOS       BINARY-LONG UNSIGNED.
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    01 LK-POSITION.
        02 LK-X         BINARY-LONG.
        02 LK-Y         BINARY-LONG.
        02 LK-Z         BINARY-LONG.
    01 LK-BLOCK-ID      BINARY-LONG.

PROCEDURE DIVISION USING LK-CLIENT LK-POSITION LK-BLOCK-ID.
    COPY PROC-PACKET-INIT.

    MOVE 1 TO PAYLOADPOS

    *> Position
    CALL "Encode-Position" USING LK-POSITION PAYLOAD PAYLOADPOS

    *> block ID
    CALL "Encode-VarInt" USING LK-BLOCK-ID PAYLOAD PAYLOADPOS

    *> send packet
    COMPUTE PAYLOADLEN = PAYLOADPOS - 1
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-BlockUpdate.
