IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-OpenSignEditor.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-PACKET REPLACING IDENTIFIER BY "play/clientbound/minecraft:open_sign_editor".
    01 PAYLOAD          PIC X(32).
    01 PAYLOADPOS       BINARY-LONG UNSIGNED.
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    01 LK-POSITION.
        02 LK-X         BINARY-LONG.
        02 LK-Y         BINARY-LONG.
        02 LK-Z         BINARY-LONG.
    01 LK-IS-FRONT-TEXT BINARY-CHAR UNSIGNED.

PROCEDURE DIVISION USING LK-CLIENT LK-POSITION LK-IS-FRONT-TEXT.
    COPY PROC-PACKET-INIT.

    MOVE 1 TO PAYLOADPOS
    CALL "Encode-Position" USING LK-POSITION PAYLOAD PAYLOADPOS
    CALL "Encode-Byte" USING LK-IS-FRONT-TEXT PAYLOAD PAYLOADPOS

    COMPUTE PAYLOADLEN = PAYLOADPOS - 1
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-OpenSignEditor.
