IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-SetExperience.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-PACKET REPLACING IDENTIFIER BY "play/clientbound/minecraft:set_experience".
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(16).
    01 PAYLOADPOS       BINARY-LONG UNSIGNED.
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    *> Progress on the experience bar (0.0 - 1.0); level; total experience
    01 LK-PROGRESS      FLOAT-SHORT.
    01 LK-LEVEL         BINARY-LONG.
    01 LK-TOTAL         BINARY-LONG.

PROCEDURE DIVISION USING LK-CLIENT LK-PROGRESS LK-LEVEL LK-TOTAL.
    COPY PROC-PACKET-INIT.

    MOVE 1 TO PAYLOADPOS

    CALL "Encode-Float" USING LK-PROGRESS PAYLOAD PAYLOADPOS
    CALL "Encode-VarInt" USING LK-LEVEL PAYLOAD PAYLOADPOS
    CALL "Encode-VarInt" USING LK-TOTAL PAYLOAD PAYLOADPOS

    COMPUTE PAYLOADLEN = PAYLOADPOS - 1
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-SetExperience.
