IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-SetEquipment.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-PACKET REPLACING IDENTIFIER BY "play/clientbound/minecraft:set_equipment".
    01 PAYLOAD          PIC X(4096).
    01 PAYLOADPOS       BINARY-LONG UNSIGNED.
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    01 LK-ENTITY-ID     BINARY-LONG.
    *> 0..5: main hand, off hand, boots, leggings, chestplate, helmet; 6=body (for non-player entities)
    01 LK-SLOT-ENUM     BINARY-CHAR UNSIGNED.
    01 LK-EQUIPMENT-SLOT.
        COPY DD-INVENTORY-SLOT REPLACING LEADING ==PREFIX== BY ==LK-EQUIPMENT==.

PROCEDURE DIVISION USING LK-CLIENT LK-ENTITY-ID LK-SLOT-ENUM LK-EQUIPMENT-SLOT.
    COPY PROC-PACKET-INIT.

    MOVE 1 TO PAYLOADPOS

    CALL "Encode-VarInt" USING LK-ENTITY-ID PAYLOAD PAYLOADPOS
    CALL "Encode-Byte" USING LK-SLOT-ENUM PAYLOAD PAYLOADPOS
    CALL "Encode-InventorySlot" USING LK-EQUIPMENT-SLOT PAYLOAD PAYLOADPOS

    COMPUTE PAYLOADLEN = PAYLOADPOS - 1
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-SetEquipment.
