IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-UpdateTime.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-PACKET REPLACING IDENTIFIER BY "play/clientbound/minecraft:set_time".
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(17).
    01 PAYLOADPOS       BINARY-LONG UNSIGNED.
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    01 LK-WORLD-AGE     BINARY-LONG-LONG.
    01 LK-TIME          BINARY-LONG-LONG.

PROCEDURE DIVISION USING LK-CLIENT LK-WORLD-AGE LK-TIME.
    COPY PROC-PACKET-INIT.

    MOVE 1 TO PAYLOADPOS

    *> world age
    CALL "Encode-Long" USING LK-WORLD-AGE PAYLOAD PAYLOADPOS

    *> time of day
    CALL "Encode-Long" USING LK-TIME PAYLOAD PAYLOADPOS

    *> time of day increasing
    MOVE X"01" TO PAYLOAD(PAYLOADPOS:1)
    ADD 1 TO PAYLOADPOS

    *> send packet
    COMPUTE PAYLOADLEN = PAYLOADPOS - 1
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-UpdateTime.
