IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-FinishConfiguration.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PACKET-ID        BINARY-LONG             VALUE H'03'.
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(1).
    01 PAYLOADLEN       BINARY-LONG UNSIGNED    VALUE 0.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.

PROCEDURE DIVISION USING LK-CLIENT.
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-FinishConfiguration.
