IDENTIFICATION DIVISION.
PROGRAM-ID. RecvPacket-AcceptTeleport.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CLIENTS.
    01 TELEPORT-ID              BINARY-LONG.
LINKAGE SECTION.
    01 LK-CLIENT                BINARY-LONG UNSIGNED.
    01 LK-BUFFER                PIC X ANY LENGTH.
    01 LK-OFFSET                BINARY-LONG UNSIGNED.

PROCEDURE DIVISION USING LK-CLIENT LK-BUFFER LK-OFFSET.
    CALL "Decode-VarInt" USING LK-BUFFER LK-OFFSET TELEPORT-ID
    IF TELEPORT-ID > TELEPORT-RECV(LK-CLIENT) AND TELEPORT-ID <= TELEPORT-SENT(LK-CLIENT)
        MOVE TELEPORT-ID TO TELEPORT-RECV(LK-CLIENT)
    END-IF

    GOBACK.

END PROGRAM RecvPacket-AcceptTeleport.
