IDENTIFICATION DIVISION.
PROGRAM-ID. RecvPacket-ChatCommand.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CLIENTS.
    *> payload
    01 MESSAGE-BUFFER           PIC X(256).
    01 MESSAGE-LENGTH           BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT                BINARY-LONG UNSIGNED.
    01 LK-BUFFER                PIC X ANY LENGTH.
    01 LK-OFFSET                BINARY-LONG UNSIGNED.

PROCEDURE DIVISION USING LK-CLIENT LK-BUFFER LK-OFFSET.
    CALL "Decode-String" USING LK-BUFFER LK-OFFSET MESSAGE-LENGTH MESSAGE-BUFFER

    IF MESSAGE-LENGTH > 256
        CALL "Server-DisconnectClient" USING LK-CLIENT
        GOBACK
    END-IF

    CALL "HandleCommand" USING LK-CLIENT MESSAGE-BUFFER MESSAGE-LENGTH

    GOBACK.

END PROGRAM RecvPacket-ChatCommand.
