IDENTIFICATION DIVISION.
PROGRAM-ID. RecvPacket-KeepAlive.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CLIENTS.
LINKAGE SECTION.
    01 LK-CLIENT                BINARY-LONG UNSIGNED.
    01 LK-BUFFER                PIC X ANY LENGTH.
    01 LK-OFFSET                BINARY-LONG UNSIGNED.

PROCEDURE DIVISION USING LK-CLIENT LK-BUFFER LK-OFFSET.
    CALL "Decode-Long" USING LK-BUFFER LK-OFFSET KEEPALIVE-RECV(LK-CLIENT)
    GOBACK.

END PROGRAM RecvPacket-KeepAlive.
