IDENTIFICATION DIVISION.
PROGRAM-ID. RecvPacket-PlayerAbilities.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CLIENTS.
    COPY DD-PLAYERS.
    01 PLAYER-ID                BINARY-LONG.
    *> payload
    01 ABILITIES                BINARY-CHAR UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT                BINARY-LONG UNSIGNED.
    01 LK-BUFFER                PIC X ANY LENGTH.
    01 LK-OFFSET                BINARY-LONG UNSIGNED.

PROCEDURE DIVISION USING LK-CLIENT LK-BUFFER LK-OFFSET.
    MOVE CLIENT-PLAYER(LK-CLIENT) TO PLAYER-ID

    CALL "Decode-Byte" USING LK-BUFFER LK-OFFSET ABILITIES

    *> flying = bitmask & 0x02
    COMPUTE ABILITIES = ABILITIES / 2
    COMPUTE PLAYER-FLYING(PLAYER-ID) = FUNCTION MOD(ABILITIES, 2)

    GOBACK.

END PROGRAM RecvPacket-PlayerAbilities.
