IDENTIFICATION DIVISION.
PROGRAM-ID. RecvPacket-SetCarriedItem.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CLIENTS.
    COPY DD-PLAYERS.
    01 PLAYER-ID                BINARY-LONG.
    01 SLOT-NUMBER              BINARY-SHORT.
LINKAGE SECTION.
    01 LK-CLIENT                BINARY-LONG UNSIGNED.
    01 LK-BUFFER                PIC X ANY LENGTH.
    01 LK-OFFSET                BINARY-LONG UNSIGNED.

PROCEDURE DIVISION USING LK-CLIENT LK-BUFFER LK-OFFSET.
    MOVE CLIENT-PLAYER(LK-CLIENT) TO PLAYER-ID

    CALL "Decode-Short" USING LK-BUFFER LK-OFFSET SLOT-NUMBER
    IF SLOT-NUMBER >= 0 AND SLOT-NUMBER <= 8
        MOVE SLOT-NUMBER TO PLAYER-HOTBAR(PLAYER-ID)
    END-IF

    GOBACK.

END PROGRAM RecvPacket-SetCarriedItem.
