IDENTIFICATION DIVISION.
PROGRAM-ID. RecvPacket-StatusRequest.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CLIENTS.
    COPY DD-SERVER-PROPERTIES.
    01 CLIENT-INDEX             BINARY-LONG UNSIGNED.
    01 CURRENT-PLAYERS          BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT                BINARY-LONG UNSIGNED.
    01 LK-BUFFER                PIC X ANY LENGTH.
    01 LK-OFFSET                BINARY-LONG UNSIGNED.

PROCEDURE DIVISION USING LK-CLIENT LK-BUFFER LK-OFFSET.
    MOVE 0 TO CURRENT-PLAYERS
    PERFORM VARYING CLIENT-INDEX FROM 1 BY 1 UNTIL CLIENT-INDEX > MAX-CLIENTS
        IF CLIENT-STATE(CLIENT-INDEX) >= 0 AND CLIENT-PLAYER(CLIENT-INDEX) > 0
            ADD 1 TO CURRENT-PLAYERS
        END-IF
    END-PERFORM
    CALL "SendPacket-Status" USING LK-CLIENT SP-MOTD MAX-PLAYERS CURRENT-PLAYERS
    GOBACK.

END PROGRAM RecvPacket-StatusRequest.
