
IDENTIFICATION DIVISION.
PROGRAM-ID. $progid$.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 COND                     BINARY-CHAR UNSIGNED.
    01 POOL-SIZE                BINARY-LONG UNSIGNED.
    01 POOL-IDS.
        02 POOL-ID              PIC X(64) OCCURS 0 TO 16 TIMES DEPENDING ON POOL-SIZE.
LINKAGE SECTION.
    01 LK-POS.
        02 LK-X                 BINARY-LONG.
        02 LK-Y                 BINARY-LONG.
        02 LK-Z                 BINARY-LONG.
    01 LK-SURVIVES-EXPLOSION    BINARY-CHAR UNSIGNED.

PROCEDURE DIVISION USING LK-POS LK-SURVIVES-EXPLOSION.
$body:indent=4$
    GOBACK.

END PROGRAM $progid$.
