MOVE COND TO COND-BACKUP
MOVE 1 TO COND
$conditions$
IF COND NOT = 0
    $count-provider$
    CALL "LootTables-SetCount" USING ITEM-COUNT(POOL-SIZE) NUM "$add$"
END-IF
MOVE COND-BACKUP TO COND
