10 STRUCT-WAXED             BINARY-CHAR UNSIGNED.
10 STRUCT-FRONT-GLOWING     BINARY-CHAR UNSIGNED.
10 STRUCT-FRONT-COLOR       PIC X(16).
10 STRUCT-FRONT-LINES.
    COPY DD-SIGN-LINES REPLACING LEADING ==PREFIX== BY ==STRUCT-FRONT==.
10 STRUCT-BACK-GLOWING      BINARY-CHAR UNSIGNED.
10 STRUCT-BACK-COLOR        PIC X(16).
10 STRUCT-BACK-LINES.
    COPY DD-SIGN-LINES REPLACING LEADING ==PREFIX== BY ==STRUCT-BACK==.
