IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-PingResponse.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-PACKET REPLACING IDENTIFIER BY "status/clientbound/minecraft:pong_response".
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(8).
    01 PAYLOADPOS       BINARY-LONG UNSIGNED.
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    01 LK-PING-ID       BINARY-LONG-LONG.

PROCEDURE DIVISION USING LK-CLIENT LK-PING-ID.
    COPY PROC-PACKET-INIT.

    MOVE 1 TO PAYLOADPOS
    CALL "Encode-Long" USING LK-PING-ID PAYLOAD PAYLOADPOS

    COMPUTE PAYLOADLEN = PAYLOADPOS - 1
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-PingResponse.
