IDENTIFICATION DIVISION.
PROGRAM-ID. Generated-Registries.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-REGISTRIES.

PROCEDURE DIVISION.
    INITIALIZE REGISTRIES
    MOVE $registry-count$ TO REGISTRY-COUNT
$registrations:indent=4$
    GOBACK.

END PROGRAM Generated-Registries.
