*> --- Test: encode.cob ---
IDENTIFICATION DIVISION.
PROGRAM-ID. Test-Encode.

PROCEDURE DIVISION.
    COPY TEST-SUITE REPLACING ==NAME== BY =="encoding/encode.cob"==.
    CALL "Test-Encode-Byte"
    CALL "Test-Encode-UnsignedShort"
    CALL "Test-Encode-UnsignedInt"
    CALL "Test-Encode-VarInt"
    CALL "Test-Encode-GetVarIntLength"
    CALL "Test-Encode-UnsignedLong"
    CALL "Test-Encode-Long"
    CALL "Test-Encode-Double"
    CALL "Test-Encode-Float"
    CALL "Test-Encode-String"
    CALL "Test-Encode-Angle"
    CALL "Test-Encode-Position"
    CALL "Test-Encode-InventorySlot"
    GOBACK.

    *> --- Test: Encode-Byte ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-Byte.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     BINARY-CHAR.
        01 BUFFER       PIC X(10).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-Byte"==.
    Byte0.
        COPY TEST-CASE REPLACING ==NAME== BY =="0"==.
        MOVE 0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Byte" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"00" AND BUFFERPOS = 2==.
    ByteMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="127"==.
        MOVE 127 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Byte" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"7F" AND BUFFERPOS = 2==.
    ByteMin.
        COPY TEST-CASE REPLACING ==NAME== BY =="-128"==.
        MOVE -128 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Byte" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"80" AND BUFFERPOS = 2==.

        GOBACK.

    END PROGRAM Test-Encode-Byte.

    *> --- Test: Encode-UnsignedShort ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-UnsignedShort.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     BINARY-SHORT UNSIGNED.
        01 BUFFER       PIC X(10).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-UnsignedShort"==.
    Short0.
        COPY TEST-CASE REPLACING ==NAME== BY =="0"==.
        MOVE 0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-UnsignedShort" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"0000" AND BUFFERPOS = 3==.
    Short1.
        COPY TEST-CASE REPLACING ==NAME== BY =="1"==.
        MOVE 1 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-UnsignedShort" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"0001" AND BUFFERPOS = 3==.
    ShortMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="65535"==.
        MOVE 65535 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-UnsignedShort" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FFFF" AND BUFFERPOS = 3==.

        GOBACK.

    END PROGRAM Test-Encode-UnsignedShort.

    *> --- Test: Encode-UnsignedInt ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-UnsignedInt.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     BINARY-LONG UNSIGNED.
        01 BUFFER       PIC X(10).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-UnsignedInt"==.
    Int0.
        COPY TEST-CASE REPLACING ==NAME== BY =="0"==.
        MOVE 0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-UnsignedInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"00000000" AND BUFFERPOS = 5==.
    Int1.
        COPY TEST-CASE REPLACING ==NAME== BY =="1"==.
        MOVE 1 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-UnsignedInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"00000001" AND BUFFERPOS = 5==.
    IntMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="4294967295"==.
        MOVE 4294967295 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-UnsignedInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FFFFFFFF" AND BUFFERPOS = 5==.

        GOBACK.

    END PROGRAM Test-Encode-UnsignedInt.

    *> --- Test: Encode-VarInt ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-VarInt.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     BINARY-LONG.
        01 BUFFER       PIC X(10).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-VarInt"==.
    Int0.
        COPY TEST-CASE REPLACING ==NAME== BY =="0"==.
        MOVE 0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-VarInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"00" AND BUFFERPOS = 2==.
    Int1.
        COPY TEST-CASE REPLACING ==NAME== BY =="1"==.
        MOVE 1 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-VarInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"01" AND BUFFERPOS = 2==.
    Int127.
        COPY TEST-CASE REPLACING ==NAME== BY =="127"==.
        MOVE 127 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-VarInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"7F" AND BUFFERPOS = 2==.
    Int128.
        COPY TEST-CASE REPLACING ==NAME== BY =="128"==.
        MOVE 128 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-VarInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"8001" AND BUFFERPOS = 3==.
    Int255.
        COPY TEST-CASE REPLACING ==NAME== BY =="255"==.
        MOVE 255 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-VarInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FF01" AND BUFFERPOS = 3==.
    Int25565.
        COPY TEST-CASE REPLACING ==NAME== BY =="25565"==.
        MOVE 25565 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-VarInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"DDC701" AND BUFFERPOS = 4==.
    Int2097151.
        COPY TEST-CASE REPLACING ==NAME== BY =="2097151"==.
        MOVE 2097151 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-VarInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FFFF7F" AND BUFFERPOS = 4==.
    IntMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="2147483647"==.
        MOVE 2147483647 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-VarInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FFFFFFFF07" AND BUFFERPOS = 6==.
    IntNegative1.
        COPY TEST-CASE REPLACING ==NAME== BY =="-1"==.
        MOVE -1 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-VarInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FFFFFFFF0F" AND BUFFERPOS = 6==.
    IntMin.
        COPY TEST-CASE REPLACING ==NAME== BY =="-2147483648"==.
        MOVE -2147483648 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-VarInt" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"8080808008" AND BUFFERPOS = 6==.

        GOBACK.

    END PROGRAM Test-Encode-VarInt.

    *> --- Test: Encode-GetVarIntLength ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-GetVarIntLength.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     BINARY-LONG.
        01 RESULT       BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-GetVarIntLength"==.
    Int0.
        COPY TEST-CASE REPLACING ==NAME== BY =="0"==.
        MOVE 0 TO VALUE-IN
        CALL "Encode-GetVarIntLength" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 1==.
    Int1.
        COPY TEST-CASE REPLACING ==NAME== BY =="1"==.
        MOVE 1 TO VALUE-IN
        CALL "Encode-GetVarIntLength" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 1==.
    Int127.
        COPY TEST-CASE REPLACING ==NAME== BY =="127"==.
        MOVE 127 TO VALUE-IN
        CALL "Encode-GetVarIntLength" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 1==.
    Int128.
        COPY TEST-CASE REPLACING ==NAME== BY =="128"==.
        MOVE 128 TO VALUE-IN
        CALL "Encode-GetVarIntLength" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 2==.
    Int255.
        COPY TEST-CASE REPLACING ==NAME== BY =="255"==.
        MOVE 255 TO VALUE-IN
        CALL "Encode-GetVarIntLength" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 2==.
    Int25565.
        COPY TEST-CASE REPLACING ==NAME== BY =="25565"==.
        MOVE 25565 TO VALUE-IN
        CALL "Encode-GetVarIntLength" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 3==.
    IntMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="2147483647"==.
        MOVE 2147483647 TO VALUE-IN
        CALL "Encode-GetVarIntLength" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 5==.
    IntNegative1.
        COPY TEST-CASE REPLACING ==NAME== BY =="-1"==.
        MOVE -1 TO VALUE-IN
        CALL "Encode-GetVarIntLength" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 5==.
    IntMin.
        COPY TEST-CASE REPLACING ==NAME== BY =="-2147483648"==.
        MOVE -2147483648 TO VALUE-IN
        CALL "Encode-GetVarIntLength" USING VALUE-IN RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = 5==.

        GOBACK.

    END PROGRAM Test-Encode-GetVarIntLength.

    *> --- Test: Encode-UnsignedLong ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-UnsignedLong.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     BINARY-LONG-LONG UNSIGNED.
        01 BUFFER       PIC X(10).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-UnsignedLong"==.
    Long0.
        COPY TEST-CASE REPLACING ==NAME== BY =="0"==.
        MOVE 0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-UnsignedLong" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"0000000000000000" AND BUFFERPOS = 9==.
    Long1.
        COPY TEST-CASE REPLACING ==NAME== BY =="1"==.
        MOVE 1 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-UnsignedLong" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"0000000000000001" AND BUFFERPOS = 9==.
    Long25565.
        COPY TEST-CASE REPLACING ==NAME== BY =="25565"==.
        MOVE 25565 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-UnsignedLong" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"00000000000063DD" AND BUFFERPOS = 9==.
    LongMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="18446744073709551615"==.
        MOVE 18446744073709551615 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-UnsignedLong" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FFFFFFFFFFFFFFFF" AND BUFFERPOS = 9==.

        GOBACK.

    END PROGRAM Test-Encode-UnsignedLong.

    *> --- Test: Encode-Long ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-Long.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     BINARY-LONG-LONG.
        01 BUFFER       PIC X(10).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-Long"==.
    Long0.
        COPY TEST-CASE REPLACING ==NAME== BY =="0"==.
        MOVE 0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Long" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"0000000000000000" AND BUFFERPOS = 9==.
    Long1.
        COPY TEST-CASE REPLACING ==NAME== BY =="1"==.
        MOVE 1 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Long" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"0000000000000001" AND BUFFERPOS = 9==.
    LongNegative1.
        COPY TEST-CASE REPLACING ==NAME== BY =="-1"==.
        MOVE -1 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Long" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FFFFFFFFFFFFFFFF" AND BUFFERPOS = 9==.
    LongMin.
        COPY TEST-CASE REPLACING ==NAME== BY =="-9223372036854775808"==.
        MOVE -9223372036854775808 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Long" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"8000000000000000" AND BUFFERPOS = 9==.
    LongMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="9223372036854775807"==.
        MOVE 9223372036854775807 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Long" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"7FFFFFFFFFFFFFFF" AND BUFFERPOS = 9==.

        GOBACK.

    END PROGRAM Test-Encode-Long.

    *> --- Test: Encode-Double ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-Double.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     FLOAT-LONG.
        01 BUFFER       PIC X(10).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-Double"==.
    PositiveZero.
        COPY TEST-CASE REPLACING ==NAME== BY =="+0.0"==.
        MOVE 0.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Double" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"0000000000000000" AND BUFFERPOS = 9==.
    NegativeZero.
        *> Note: I've found no way to differentiate +0.0 and -0.0 in COBOL, so they're encoded the same.
        COPY TEST-CASE REPLACING ==NAME== BY =="-0.0"==.
        MOVE -0.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Double" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"0000000000000000" AND BUFFERPOS = 9==.
    PositiveInfinity.
        COPY TEST-CASE REPLACING ==NAME== BY =="+Infinity"==.
        COPY TEST-SKIP REPLACING REASON BY =="FLOAT-INFINITY is not supported in GnuCOBOL"==.
    NegativeInfinity.
        COPY TEST-CASE REPLACING ==NAME== BY =="-Infinity"==.
        COPY TEST-SKIP REPLACING REASON BY =="FLOAT-INFINITY is not supported in GnuCOBOL"==.
    NaN.
        COPY TEST-CASE REPLACING ==NAME== BY =="NaN"==.
        COPY TEST-SKIP REPLACING REASON BY =="FLOAT-INFINITY is not supported in GnuCOBOL"==.
    Positive1.
        COPY TEST-CASE REPLACING ==NAME== BY =="+1.0"==.
        MOVE 1.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Double" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"3FF0000000000000" AND BUFFERPOS = 9==.
    Negative1.
        COPY TEST-CASE REPLACING ==NAME== BY =="-1.0"==.
        MOVE -1.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Double" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"BFF0000000000000" AND BUFFERPOS = 9==.
    PositiveDecimal.
        COPY TEST-CASE REPLACING ==NAME== BY =="+12.125"==.
        MOVE 12.125 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Double" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"4028400000000000" AND BUFFERPOS = 9==.
    NegativeDecimal.
        COPY TEST-CASE REPLACING ==NAME== BY =="-12.125"==.
        MOVE -12.125 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Double" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"C028400000000000" AND BUFFERPOS = 9==.
    PositiveMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="+1.79769E+308"==.
        MOVE 1.79769313486231570814527423731704357E+308 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Double" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"7FEFFFFFFFFFFFFF" AND BUFFERPOS = 9==.
    NegativeMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="-1.79769E+308"==.
        MOVE -1.79769313486231570814527423731704357E+308 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Double" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FFEFFFFFFFFFFFFF" AND BUFFERPOS = 9==.

        GOBACK.

    END PROGRAM Test-Encode-Double.

    *> --- Test: Encode-Float ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-Float.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     FLOAT-SHORT.
        01 BUFFER       PIC X(10).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-Float"==.
    PositiveZero.
        COPY TEST-CASE REPLACING ==NAME== BY =="+0.0"==.
        MOVE 0.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Float" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"00000000" AND BUFFERPOS = 5==.
    NegativeZero.
        *> Note: I've found no way to differentiate +0.0 and -0.0 in COBOL, so they're encoded the same.
        COPY TEST-CASE REPLACING ==NAME== BY =="-0.0"==.
        MOVE -0.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Float" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"00000000" AND BUFFERPOS = 5==.
    PositiveInfinity.
        COPY TEST-CASE REPLACING ==NAME== BY =="+Infinity"==.
        COPY TEST-SKIP REPLACING REASON BY =="FLOAT-INFINITY is not supported in GnuCOBOL"==.
    NegativeInfinity.
        COPY TEST-CASE REPLACING ==NAME== BY =="-Infinity"==.
        COPY TEST-SKIP REPLACING REASON BY =="FLOAT-INFINITY is not supported in GnuCOBOL"==.
    NaN.
        COPY TEST-CASE REPLACING ==NAME== BY =="NaN"==.
        COPY TEST-SKIP REPLACING REASON BY =="FLOAT-INFINITY is not supported in GnuCOBOL"==.
    Positive1.
        COPY TEST-CASE REPLACING ==NAME== BY =="+1.0"==.
        MOVE 1.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Float" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"3F800000" AND BUFFERPOS = 5==.
    Negative1.
        COPY TEST-CASE REPLACING ==NAME== BY =="-1.0"==.
        MOVE -1.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Float" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"BF800000" AND BUFFERPOS = 5==.
    PositiveDecimal.
        COPY TEST-CASE REPLACING ==NAME== BY =="+12.125"==.
        MOVE 12.125 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Float" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"41420000" AND BUFFERPOS = 5==.
    NegativeDecimal.
        COPY TEST-CASE REPLACING ==NAME== BY =="-12.125"==.
        MOVE -12.125 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Float" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"C1420000" AND BUFFERPOS = 5==.
    PositiveMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="+3.40282E+38"==.
        MOVE 3.40282346638528859811704183484516925E+38 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Float" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"7F7FFFFF" AND BUFFERPOS = 5==.
    NegativeMax.
        COPY TEST-CASE REPLACING ==NAME== BY =="-3.40282E+38"==.
        MOVE -3.40282346638528859811704183484516925E+38 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Float" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FF7FFFFF" AND BUFFERPOS = 5==.

        GOBACK.

    END PROGRAM Test-Encode-Float.

    *> --- Test: Encode-String ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-String.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 STR          PIC X(16).
        01 STR-LEN      BINARY-LONG UNSIGNED.
        01 BUFFER       PIC X(16).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-String"==.
    Empty.
        COPY TEST-CASE REPLACING ==NAME== BY =="''"==.
        MOVE SPACES TO STR
        MOVE 0 TO STR-LEN
        MOVE ALL X"FF" TO BUFFER
        MOVE 2 TO BUFFERPOS
        CALL "Encode-String" USING STR STR-LEN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FF00FFFFFFFFFFFFFFFFFFFFFFFFFFFF" AND BUFFERPOS = 3==.
    HelloWorld.
        COPY TEST-CASE REPLACING ==NAME== BY =="'Hello, World!'"==.
        MOVE "Hello, World!" TO STR
        MOVE 13 TO STR-LEN
        MOVE ALL X"FF" TO BUFFER
        MOVE 2 TO BUFFERPOS
        CALL "Encode-String" USING STR STR-LEN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"FF0D48656C6C6F2C20576F726C6421FF" AND BUFFERPOS = 16==.

        GOBACK.

    END PROGRAM Test-Encode-String.

    *> --- Test: Encode-Angle ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-Angle.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     FLOAT-SHORT.
        01 BUFFER       PIC X(10).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-Angle"==.
    ZeroDeg.
        COPY TEST-CASE REPLACING ==NAME== BY =="0.0deg"==.
        MOVE 0.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Angle" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"00" AND BUFFERPOS = 2==.
    HalfRotation.
        COPY TEST-CASE REPLACING ==NAME== BY =="180.0deg"==.
        MOVE 180.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Angle" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"80" AND BUFFERPOS = 2==.
    Over360.
        COPY TEST-CASE REPLACING ==NAME== BY =="560.0deg"==.
        MOVE 560.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Angle" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"8E" AND BUFFERPOS = 2==.
    NegativeDeg.
        COPY TEST-CASE REPLACING ==NAME== BY =="-90.0deg"==.
        MOVE -90.0 TO VALUE-IN
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Angle" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"C0" AND BUFFERPOS = 2==.

        GOBACK.

    END PROGRAM Test-Encode-Angle.

    *> --- Test: Encode-Position ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-Position.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN.
            02 VALUE-X  BINARY-LONG.
            02 VALUE-Y  BINARY-LONG.
            02 VALUE-Z  BINARY-LONG.
        01 BUFFER       PIC X(10).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.
        01 HEXSTR       PIC X(20).

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-Position"==.
    AllZero.
        COPY TEST-CASE REPLACING ==NAME== BY =="(0, 0, 0)"==.
        MOVE 0 TO VALUE-X
        MOVE 0 TO VALUE-Y
        MOVE 0 TO VALUE-Z
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Position" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"0000000000000000" AND BUFFERPOS = 9==.
    WikiVgExample.
        COPY TEST-CASE REPLACING ==NAME== BY =="18357644 831 -20882616"==.
        MOVE 18357644 TO VALUE-X
        MOVE 831 TO VALUE-Y
        MOVE -20882616 TO VALUE-Z
        MOVE 1 TO BUFFERPOS
        CALL "Encode-Position" USING VALUE-IN BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"4607632C15B4833F" AND BUFFERPOS = 9==.

        GOBACK.

    END PROGRAM Test-Encode-Position.

    *> --- Test: Test-Encode-InventorySlot ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-Encode-InventorySlot.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 IN-SLOT.
            COPY DD-INVENTORY-SLOT REPLACING LEADING ==PREFIX== BY ==IN==.
        01 BUFFER       PIC X(256).
        01 BUFFERPOS    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="Encode-InventorySlot"==.
    Empty.
        COPY TEST-CASE REPLACING ==NAME== BY =="empty"==.
        MOVE 0 TO IN-SLOT-COUNT
        MOVE 1234 TO IN-SLOT-ID
        MOVE 42 TO IN-SLOT-NBT-LENGTH
        MOVE "Hello, World!" TO IN-SLOT-NBT-DATA
        INITIALIZE BUFFER
        MOVE 1 TO BUFFERPOS
        CALL "Encode-InventorySlot" USING IN-SLOT BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"00" AND BUFFERPOS = 2==.
    Simple.
        COPY TEST-CASE REPLACING ==NAME== BY =="simple"==.
        MOVE 42 TO IN-SLOT-COUNT
        MOVE 25565 TO IN-SLOT-ID
        MOVE 2 TO IN-SLOT-NBT-LENGTH
        MOVE X"0000" TO IN-SLOT-NBT-DATA
        INITIALIZE BUFFER
        MOVE 1 TO BUFFERPOS
        CALL "Encode-InventorySlot" USING IN-SLOT BUFFER BUFFERPOS
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"2ADDC7010000" AND BUFFERPOS = 7==.

        GOBACK.

    END PROGRAM Test-Encode-InventorySlot.

END PROGRAM Test-Encode.
