*> --- Test: uuid.cob ---
IDENTIFICATION DIVISION.
PROGRAM-ID. Test-UUID.

PROCEDURE DIVISION.
    DISPLAY "Test: uuid.cob"
    CALL "Test-UUID-ToString"
    CALL "Test-UUID-FromString"
    GOBACK.

    *> --- Test: UUID-ToString ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-UUID-ToString.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 BUFFER       PIC X(20).
        01 RESULT       PIC X(36).

    PROCEDURE DIVISION.
        DISPLAY "  Test: UUID-ToString".
    AllZero.
        DISPLAY "    Case: 00000000-0000-0000-0000-000000000000 - " WITH NO ADVANCING
        MOVE X"00000000000000000000000000000000" TO BUFFER
        CALL "UUID-ToString" USING BUFFER RESULT
        IF RESULT = "00000000-0000-0000-0000-000000000000"
            DISPLAY "PASS"
        ELSE
            DISPLAY "FAIL"
        END-IF.
    LeadingZero.
        DISPLAY "    Case: 00000000-0000-0000-0000-000000000001 - " WITH NO ADVANCING
        MOVE X"00000000000000000000000000000001" TO BUFFER
        CALL "UUID-ToString" USING BUFFER RESULT
        IF RESULT = "00000000-0000-0000-0000-000000000001"
            DISPLAY "PASS"
        ELSE
            DISPLAY "FAIL"
        END-IF.
    RandomUuid.
        DISPLAY "    Case: d826ed27-8ee9-4918-83ff-f1b5968c9421 - " WITH NO ADVANCING
        MOVE X"D826ED278EE9491883FFF1B5968C9421" TO BUFFER
        CALL "UUID-ToString" USING BUFFER RESULT
        IF RESULT = "d826ed27-8ee9-4918-83ff-f1b5968c9421"
            DISPLAY "PASS"
        ELSE
            DISPLAY "FAIL"
        END-IF.

        GOBACK.

    END PROGRAM Test-UUID-ToString.

    *> --- Test: UUID-FromString ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-UUID-FromString.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     PIC X(36).
        01 BUFFER       PIC X(20).

    PROCEDURE DIVISION.
        DISPLAY "  Test: UUID-FromString".
    AllZero.
        DISPLAY "    Case: 00000000-0000-0000-0000-000000000000 - " WITH NO ADVANCING
        MOVE "00000000-0000-0000-0000-000000000000" TO VALUE-IN
        CALL "UUID-FromString" USING VALUE-IN BUFFER
        IF BUFFER = X"00000000000000000000000000000000"
            DISPLAY "PASS"
        ELSE
            DISPLAY "FAIL"
        END-IF.
    LeadingZero.
        DISPLAY "    Case: 00000000-0000-0000-0000-000000000001 - " WITH NO ADVANCING
        MOVE "00000000-0000-0000-0000-000000000001" TO VALUE-IN
        CALL "UUID-FromString" USING VALUE-IN BUFFER
        IF BUFFER = X"00000000000000000000000000000001"
            DISPLAY "PASS"
        ELSE
            DISPLAY "FAIL"
        END-IF.
    RandomUuid.
        DISPLAY "    Case: d826ed27-8ee9-4918-83ff-f1b5968c9421 - " WITH NO ADVANCING
        MOVE "d826ed27-8ee9-4918-83ff-f1b5968c9421" TO VALUE-IN
        CALL "UUID-FromString" USING VALUE-IN BUFFER
        IF BUFFER = X"D826ED278EE9491883FFF1B5968C9421"
            DISPLAY "PASS"
        ELSE
            DISPLAY "FAIL"
        END-IF.

        GOBACK.

    END PROGRAM Test-UUID-FromString.

END PROGRAM Test-UUID.
