*> --- Test: uuid.cob ---
IDENTIFICATION DIVISION.
PROGRAM-ID. Test-UUID.

PROCEDURE DIVISION.
    COPY TEST-SUITE REPLACING ==NAME== BY =="encoding/uuid.cob"==.
    CALL "Test-UUID-ToString"
    CALL "Test-UUID-FromString"
    GOBACK.

    *> --- Test: UUID-ToString ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-UUID-ToString.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 BUFFER       PIC X(20).
        01 RESULT       PIC X(36).

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="UUID-ToString"==.
    AllZero.
        COPY TEST-CASE REPLACING ==NAME== BY =="00000000-0000-0000-0000-000000000000"==.
        MOVE X"00000000000000000000000000000000" TO BUFFER
        CALL "UUID-ToString" USING BUFFER RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = "00000000-0000-0000-0000-000000000000"==.
    LeadingZero.
        COPY TEST-CASE REPLACING ==NAME== BY =="00000000-0000-0000-0000-000000000001"==.
        MOVE X"00000000000000000000000000000001" TO BUFFER
        CALL "UUID-ToString" USING BUFFER RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = "00000000-0000-0000-0000-000000000001"==.
    RandomUuid.
        COPY TEST-CASE REPLACING ==NAME== BY =="d826ed27-8ee9-4918-83ff-f1b5968c9421"==.
        MOVE X"D826ED278EE9491883FFF1B5968C9421" TO BUFFER
        CALL "UUID-ToString" USING BUFFER RESULT
        COPY TEST-ASSERT REPLACING COND BY ==RESULT = "d826ed27-8ee9-4918-83ff-f1b5968c9421"==.

        GOBACK.

    END PROGRAM Test-UUID-ToString.

    *> --- Test: UUID-FromString ---
    IDENTIFICATION DIVISION.
    PROGRAM-ID. Test-UUID-FromString.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 VALUE-IN     PIC X(36).
        01 BUFFER       PIC X(20).

    PROCEDURE DIVISION.
        COPY TEST-UNIT REPLACING ==NAME== BY =="UUID-FromString"==.
    AllZero.
        COPY TEST-CASE REPLACING ==NAME== BY =="00000000-0000-0000-0000-000000000000"==.
        MOVE "00000000-0000-0000-0000-000000000000" TO VALUE-IN
        CALL "UUID-FromString" USING VALUE-IN BUFFER
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"00000000000000000000000000000000"==.
    LeadingZero.
        COPY TEST-CASE REPLACING ==NAME== BY =="00000000-0000-0000-0000-000000000001"==.
        MOVE "00000000-0000-0000-0000-000000000001" TO VALUE-IN
        CALL "UUID-FromString" USING VALUE-IN BUFFER
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"00000000000000000000000000000001"==.
    RandomUuid.
        COPY TEST-CASE REPLACING ==NAME== BY =="d826ed27-8ee9-4918-83ff-f1b5968c9421"==.
        MOVE "d826ed27-8ee9-4918-83ff-f1b5968c9421" TO VALUE-IN
        CALL "UUID-FromString" USING VALUE-IN BUFFER
        COPY TEST-ASSERT REPLACING COND BY ==BUFFER = X"D826ED278EE9491883FFF1B5968C9421"==.

        GOBACK.

    END PROGRAM Test-UUID-FromString.

END PROGRAM Test-UUID.
