IDENTIFICATION DIVISION.
PROGRAM-ID. Generated-Items.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-ITEMS.
    01 MSS                      BINARY-LONG UNSIGNED.

PROCEDURE DIVISION.
    INITIALIZE ITEMS

$registrations:indent=4$
    GOBACK.

    IDENTIFICATION DIVISION.
    PROGRAM-ID. Register.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
        COPY DD-ITEMS.
        01 ITEM-ID              BINARY-LONG.
    LINKAGE SECTION.
        01 LK-ITEM-NAME         PIC X ANY LENGTH.
        01 LK-MAX-STACK-SIZE    BINARY-LONG UNSIGNED.

    PROCEDURE DIVISION USING LK-ITEM-NAME LK-MAX-STACK-SIZE.
        CALL "Registries-Get-EntryId" USING "minecraft:item" LK-ITEM-NAME ITEM-ID
        MOVE LK-MAX-STACK-SIZE TO ITEM-ENTRY-MAX-STACK-SIZE(ITEM-ID + 1)
        ADD 1 TO ITEMS-COUNT
        GOBACK.

    END PROGRAM Register.

END PROGRAM Generated-Items.
