IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-GameEvent.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PACKET-ID        BINARY-LONG             VALUE H'22'.
    *> temporary data used during encoding
    01 BUFFER           PIC X(8).
    01 BUFFERLEN        BINARY-LONG UNSIGNED.
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(8).
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    01 LK-EVENT         BINARY-CHAR UNSIGNED.
    01 LK-VALUE         FLOAT-SHORT.

PROCEDURE DIVISION USING LK-CLIENT LK-EVENT LK-VALUE.
    MOVE 0 TO PAYLOADLEN

    *> event type
    MOVE FUNCTION CHAR(LK-EVENT + 1) TO PAYLOAD(PAYLOADLEN + 1:1)
    ADD 1 TO PAYLOADLEN

    *> event value
    CALL "Encode-Float" USING LK-VALUE BUFFER BUFFERLEN
    MOVE BUFFER TO PAYLOAD(PAYLOADLEN + 1:BUFFERLEN)
    ADD BUFFERLEN TO PAYLOADLEN

    *> send packet
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-GameEvent.
