IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-KnownPacks.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PACKET-ID        BINARY-LONG             VALUE H'0E'.
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(1024).
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
    *> temporary
    01 INT32            BINARY-LONG.
    01 BUFFER           PIC X(8).
    01 BUFFERLEN        BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.

PROCEDURE DIVISION USING LK-CLIENT.
    MOVE 0 TO PAYLOADLEN

    *> count
    MOVE 1 TO INT32
    CALL "Encode-VarInt" USING INT32 BUFFER BUFFERLEN
    MOVE BUFFER TO PAYLOAD(PAYLOADLEN + 1:BUFFERLEN)
    ADD BUFFERLEN TO PAYLOADLEN

    *> pack namespace
    MOVE FUNCTION CHAR(9 + 1) TO PAYLOAD(PAYLOADLEN + 1:1)
    ADD 1 TO PAYLOADLEN
    MOVE "minecraft" TO PAYLOAD(PAYLOADLEN + 1:9)
    ADD 9 TO PAYLOADLEN

    *> pack id
    MOVE FUNCTION CHAR(4 + 1) TO PAYLOAD(PAYLOADLEN + 1:1)
    ADD 1 TO PAYLOADLEN
    MOVE "core" TO PAYLOAD(PAYLOADLEN + 1:4)
    ADD 4 TO PAYLOADLEN

    *> pack version
    MOVE FUNCTION CHAR(6 + 1) TO PAYLOAD(PAYLOADLEN + 1:1)
    ADD 1 TO PAYLOADLEN
    MOVE "1.20.6" TO PAYLOAD(PAYLOADLEN + 1:6)
    ADD 6 TO PAYLOADLEN

    *> send packet
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-KnownPacks.
