IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-PingResponse.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PACKET-ID        BINARY-LONG             VALUE H'01'.
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(8).
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-CLIENT        BINARY-LONG UNSIGNED.
    01 LK-PING-ID       BINARY-LONG-LONG.

PROCEDURE DIVISION USING LK-CLIENT LK-PING-ID.
    CALL "Encode-Long" USING LK-PING-ID PAYLOAD PAYLOADLEN
    CALL "SendPacket" USING LK-CLIENT PACKET-ID PAYLOAD PAYLOADLEN
    GOBACK.

END PROGRAM SendPacket-PingResponse.
