IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-PingResponse.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PACKET-ID        BINARY-LONG             VALUE H'01'.
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(8).
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-HNDL          PIC X(4).
    01 LK-ERRNO         PIC 9(3).
    01 LK-PING-ID       BINARY-LONG-LONG.

PROCEDURE DIVISION USING LK-HNDL LK-ERRNO LK-PING-ID.
    CALL "Encode-Long" USING LK-PING-ID PAYLOAD PAYLOADLEN
    CALL "SendPacket" USING LK-HNDL PACKET-ID PAYLOAD PAYLOADLEN LK-ERRNO
    GOBACK.

END PROGRAM SendPacket-PingResponse.
