IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-Registry.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT FD-REGISTRY-BLOB ASSIGN TO "blobs/registry_packets.txt"
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
    FD FD-REGISTRY-BLOB.
        01 REGISTRY-BLOB-REC    PIC X(64).
WORKING-STORAGE SECTION.
    01 HEX              PIC X(64).
    01 HEXLEN           BINARY-LONG UNSIGNED.
    01 BUFFER           PIC X(32).
    01 BUFFERLEN        BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-HNDL          PIC X(4).
    01 LK-ERRNO         PIC 9(3).

PROCEDURE DIVISION USING LK-HNDL LK-ERRNO.
    OPEN INPUT FD-REGISTRY-BLOB
    MOVE 64 TO HEXLEN
    PERFORM UNTIL HEXLEN = 0
        MOVE SPACES TO HEX(1:64)
        READ FD-REGISTRY-BLOB INTO HEX
            AT END
                MOVE 0 TO HEXLEN
            NOT AT END
                CALL "DecodeHexString" USING HEX HEXLEN BUFFER BUFFERLEN
                CALL "Socket-Write" USING LK-HNDL LK-ERRNO BUFFERLEN BUFFER
                IF LK-ERRNO NOT = 0
                    MOVE 0 TO HEXLEN
                END-IF
        END-READ
    END-PERFORM
    CLOSE FD-REGISTRY-BLOB
    GOBACK.

END PROGRAM SendPacket-Registry.
