IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-SetHeldItem.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PACKET-ID        BINARY-LONG             VALUE H'53'.
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(1).
    01 PAYLOADLEN       BINARY-LONG UNSIGNED    VALUE 1.
LINKAGE SECTION.
    01 LK-HNDL          PIC X(4).
    01 LK-ERRNO         PIC 9(3).
    01 LK-SLOT          BINARY-CHAR UNSIGNED.

PROCEDURE DIVISION USING LK-HNDL LK-ERRNO LK-SLOT.
    MOVE FUNCTION CHAR(LK-SLOT + 1) TO PAYLOAD(1:1)
    CALL "SendPacket" USING LK-HNDL PACKET-ID PAYLOAD PAYLOADLEN LK-ERRNO
    GOBACK.

END PROGRAM SendPacket-SetHeldItem.
