IDENTIFICATION DIVISION.
PROGRAM-ID. SendPacket-UpdateTime.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PACKET-ID        BINARY-LONG             VALUE H'62'.
    *> buffer used to store the packet data
    01 PAYLOAD          PIC X(16).
    01 PAYLOADLEN       BINARY-LONG UNSIGNED.
    *> temporary data
    01 BUFFER           PIC X(8).
    01 BUFFERLEN        BINARY-LONG UNSIGNED.
LINKAGE SECTION.
    01 LK-HNDL          PIC X(4).
    01 LK-ERRNO         PIC 9(3).
    01 LK-WORLD-AGE     BINARY-LONG-LONG.
    01 LK-TIME          BINARY-LONG-LONG.

PROCEDURE DIVISION USING LK-HNDL LK-ERRNO LK-WORLD-AGE LK-TIME.
    MOVE 0 TO PAYLOADLEN

    *> world age
    CALL "Encode-Long" USING LK-WORLD-AGE BUFFER BUFFERLEN
    MOVE BUFFER TO PAYLOAD(PAYLOADLEN + 1:BUFFERLEN)
    ADD BUFFERLEN TO PAYLOADLEN

    *> time of day
    CALL "Encode-Long" USING LK-TIME BUFFER BUFFERLEN
    MOVE BUFFER TO PAYLOAD(PAYLOADLEN + 1:BUFFERLEN)
    ADD BUFFERLEN TO PAYLOADLEN

    *> send packet
    CALL "SendPacket" USING LK-HNDL PACKET-ID PAYLOAD PAYLOADLEN LK-ERRNO
    GOBACK.

END PROGRAM SendPacket-UpdateTime.
