*> --- SetCallback-ItemUse ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-ItemUse.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 C-MINECRAFT-ITEM             PIC X(16) VALUE "minecraft:item".
    01 PROTOCOL-ID                  BINARY-LONG.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-ITEM-NAME                 PIC X ANY LENGTH.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-ITEM-NAME LK-CB-PTR.
    CALL "Registries-Get-EntryId" USING C-MINECRAFT-ITEM LK-ITEM-NAME PROTOCOL-ID
    MOVE LK-CB-PTR TO CB-PTR(PROTOCOL-ID + 1)
    GOBACK.

END PROGRAM SetCallback-ItemUse.

*> --- GetCallback-ItemUse ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-ItemUse.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 C-MINECRAFT-ITEM             PIC X(16) VALUE "minecraft:item".
    01 PROTOCOL-ID                  BINARY-LONG.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-ITEM-NAME                 PIC X ANY LENGTH.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-ITEM-NAME LK-CB-PTR.
    CALL "Registries-Get-EntryId" USING C-MINECRAFT-ITEM LK-ITEM-NAME PROTOCOL-ID
    MOVE CB-PTR(PROTOCOL-ID + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-ItemUse.
