*> --- Callbacks-Init ---
IDENTIFICATION DIVISION.
PROGRAM-ID. Callbacks-Init.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.

PROCEDURE DIVISION.
    INITIALIZE ITEM-CALLBACKS
    INITIALIZE BLOCK-CALLBACKS
    INITIALIZE BLOCKSTATE-CALLBACKS
    INITIALIZE BLOCK-ENTITY-CALLBACKS
    INITIALIZE ENTITY-CALLBACKS
    INITIALIZE WINDOW-CALLBACKS
    GOBACK.

END PROGRAM Callbacks-Init.

*> --- SetCallback-ItemUse ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-ItemUse.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PROTOCOL-ID                  BINARY-LONG.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-ITEM-NAME                 PIC X ANY LENGTH.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-ITEM-NAME LK-CB-PTR.
    CALL "Registries-Lookup" USING "minecraft:item" LK-ITEM-NAME PROTOCOL-ID
    MOVE LK-CB-PTR TO CB-PTR-USE(PROTOCOL-ID + 1)
    GOBACK.

END PROGRAM SetCallback-ItemUse.

*> --- GetCallback-ItemUse ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-ItemUse.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 PROTOCOL-ID                  BINARY-LONG.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-ITEM-NAME                 PIC X ANY LENGTH.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-ITEM-NAME LK-CB-PTR.
    CALL "Registries-Lookup" USING "minecraft:item" LK-ITEM-NAME PROTOCOL-ID
    MOVE CB-PTR-USE(PROTOCOL-ID + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-ItemUse.

*> --- SetCallback-BlockLoot ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-BlockLoot.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-ID                  BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-ID LK-CB-PTR.
    MOVE LK-CB-PTR TO CB-PTR-BLOCK-LOOT(LK-BLOCK-ID + 1)
    GOBACK.

END PROGRAM SetCallback-BlockLoot.

*> --- GetCallback-BlockLoot ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-BlockLoot.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-ID                  BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-ID LK-CB-PTR.
    MOVE CB-PTR-BLOCK-LOOT(LK-BLOCK-ID + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-BlockLoot.

*> --- SetCallback-BlockDestroy ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-BlockDestroy.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-STATE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-STATE LK-CB-PTR.
    MOVE LK-CB-PTR TO CB-PTR-DESTROY(LK-BLOCK-STATE + 1)
    GOBACK.

END PROGRAM SetCallback-BlockDestroy.

*> --- GetCallback-BlockDestroy ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-BlockDestroy.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-STATE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-STATE LK-CB-PTR.
    IF LK-BLOCK-STATE < 0
        SET LK-CB-PTR TO NULL
        GOBACK
    END-IF
    MOVE CB-PTR-DESTROY(LK-BLOCK-STATE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-BlockDestroy.

*> --- SetCallback-BlockInteract ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-BlockInteract.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-STATE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-STATE LK-CB-PTR.
    MOVE LK-CB-PTR TO CB-PTR-INTERACT(LK-BLOCK-STATE + 1)
    GOBACK.

END PROGRAM SetCallback-BlockInteract.

*> --- GetCallback-BlockInteract ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-BlockInteract.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-STATE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-STATE LK-CB-PTR.
    IF LK-BLOCK-STATE < 0
        SET LK-CB-PTR TO NULL
        GOBACK
    END-IF
    MOVE CB-PTR-INTERACT(LK-BLOCK-STATE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-BlockInteract.

*> --- SetCallback-BlockFace ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-BlockFace.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-STATE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-STATE LK-CB-PTR.
    MOVE LK-CB-PTR TO CB-PTR-FACE(LK-BLOCK-STATE + 1)
    GOBACK.

END PROGRAM SetCallback-BlockFace.

*> --- GetCallback-BlockFace ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-BlockFace.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-STATE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-STATE LK-CB-PTR.
    IF LK-BLOCK-STATE < 0
        SET LK-CB-PTR TO NULL
        GOBACK
    END-IF
    MOVE CB-PTR-FACE(LK-BLOCK-STATE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-BlockFace.

*> --- SetCallback-BlockReplaceable ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-BlockReplaceable.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-STATE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-STATE LK-CB-PTR.
    MOVE LK-CB-PTR TO CB-PTR-REPLACEABLE(LK-BLOCK-STATE + 1)
    GOBACK.

END PROGRAM SetCallback-BlockReplaceable.

*> --- GetCallback-BlockReplaceable ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-BlockReplaceable.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-STATE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-STATE LK-CB-PTR.
    IF LK-BLOCK-STATE < 0
        SET LK-CB-PTR TO NULL
        GOBACK
    END-IF
    MOVE CB-PTR-REPLACEABLE(LK-BLOCK-STATE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-BlockReplaceable.

*> --- SetCallback-BlockItem ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-BlockItem.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-STATE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-STATE LK-CB-PTR.
    MOVE LK-CB-PTR TO CB-PTR-BLOCK-ITEM(LK-BLOCK-STATE + 1)
    GOBACK.

END PROGRAM SetCallback-BlockItem.

*> --- GetCallback-BlockItem ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-BlockItem.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-BLOCK-STATE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-BLOCK-STATE LK-CB-PTR.
    IF LK-BLOCK-STATE < 0
        SET LK-CB-PTR TO NULL
        GOBACK
    END-IF
    MOVE CB-PTR-BLOCK-ITEM(LK-BLOCK-STATE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-BlockItem.

*> --- SetCallback-EntitySerialize ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-EntitySerialize.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-ENTITY-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-ENTITY-TYPE LK-CB-PTR.
    MOVE LK-CB-PTR TO CB-PTR-SERIALIZE(LK-ENTITY-TYPE + 1)
    GOBACK.

END PROGRAM SetCallback-EntitySerialize.

*> --- GetCallback-EntitySerialize ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-EntitySerialize.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-ENTITY-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-ENTITY-TYPE LK-CB-PTR.
    IF LK-ENTITY-TYPE < 0
        SET LK-CB-PTR TO NULL
        GOBACK
    END-IF
    MOVE CB-PTR-SERIALIZE(LK-ENTITY-TYPE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-EntitySerialize.

*> --- SetCallback-EntityDeserialize ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-EntityDeserialize.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-ENTITY-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-ENTITY-TYPE LK-CB-PTR.
    MOVE LK-CB-PTR TO CB-PTR-DESERIALIZE(LK-ENTITY-TYPE + 1)
    GOBACK.

END PROGRAM SetCallback-EntityDeserialize.

*> --- GetCallback-EntityDeserialize ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-EntityDeserialize.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-ENTITY-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-ENTITY-TYPE LK-CB-PTR.
    IF LK-ENTITY-TYPE < 0
        SET LK-CB-PTR TO NULL
        GOBACK
    END-IF
    MOVE CB-PTR-DESERIALIZE(LK-ENTITY-TYPE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-EntityDeserialize.

*> --- SetCallback-EntityTick ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-EntityTick.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-ENTITY-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-ENTITY-TYPE LK-CB-PTR.
    MOVE LK-CB-PTR TO CB-PTR-TICK(LK-ENTITY-TYPE + 1)
    GOBACK.

END PROGRAM SetCallback-EntityTick.

*> --- GetCallback-EntityTick ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-EntityTick.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-ENTITY-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-ENTITY-TYPE LK-CB-PTR.
    IF LK-ENTITY-TYPE < 0
        SET LK-CB-PTR TO NULL
        GOBACK
    END-IF
    MOVE CB-PTR-TICK(LK-ENTITY-TYPE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-EntityTick.

*> --- SetCallback-WindowSync ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-WindowSync.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-WINDOW-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-WINDOW-TYPE LK-CB-PTR.
    IF LK-WINDOW-TYPE < 0
        MOVE LK-CB-PTR TO CB-PTR-SYNC-PLAYER
        GOBACK
    END-IF
    MOVE LK-CB-PTR TO CB-PTR-SYNC(LK-WINDOW-TYPE + 1)
    GOBACK.

END PROGRAM SetCallback-WindowSync.

*> --- GetCallback-WindowSync ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-WindowSync.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-WINDOW-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-WINDOW-TYPE LK-CB-PTR.
    IF LK-WINDOW-TYPE < 0
        MOVE CB-PTR-SYNC-PLAYER TO LK-CB-PTR
        GOBACK
    END-IF
    MOVE CB-PTR-SYNC(LK-WINDOW-TYPE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-WindowSync.

*> --- SetCallback-WindowClose ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-WindowClose.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-WINDOW-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-WINDOW-TYPE LK-CB-PTR.
    IF LK-WINDOW-TYPE < 0
        MOVE LK-CB-PTR TO CB-PTR-CLOSE-PLAYER
        GOBACK
    END-IF
    MOVE LK-CB-PTR TO CB-PTR-CLOSE(LK-WINDOW-TYPE + 1)
    GOBACK.

END PROGRAM SetCallback-WindowClose.

*> --- GetCallback-WindowClose ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-WindowClose.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-WINDOW-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-WINDOW-TYPE LK-CB-PTR.
    IF LK-WINDOW-TYPE < 0
        MOVE CB-PTR-CLOSE-PLAYER TO LK-CB-PTR
        GOBACK
    END-IF
    MOVE CB-PTR-CLOSE(LK-WINDOW-TYPE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-WindowClose.

*> --- SetCallback-WindowSetSlot ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-WindowSetSlot.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-WINDOW-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-WINDOW-TYPE LK-CB-PTR.
    IF LK-WINDOW-TYPE < 0
        MOVE LK-CB-PTR TO CB-PTR-SET-SLOT-PLAYER
        GOBACK
    END-IF
    MOVE LK-CB-PTR TO CB-PTR-SET-SLOT(LK-WINDOW-TYPE + 1)
    GOBACK.

END PROGRAM SetCallback-WindowSetSlot.

*> --- GetCallback-WindowSetSlot ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-WindowSetSlot.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-WINDOW-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-WINDOW-TYPE LK-CB-PTR.
    IF LK-WINDOW-TYPE < 0
        MOVE CB-PTR-SET-SLOT-PLAYER TO LK-CB-PTR
        GOBACK
    END-IF
    MOVE CB-PTR-SET-SLOT(LK-WINDOW-TYPE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-WindowSetSlot.

*> --- SetCallback-WindowDrop ---
IDENTIFICATION DIVISION.
PROGRAM-ID. SetCallback-WindowDrop.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-WINDOW-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-WINDOW-TYPE LK-CB-PTR.
    IF LK-WINDOW-TYPE < 0
        MOVE LK-CB-PTR TO CB-PTR-DROP-PLAYER
        GOBACK
    END-IF
    MOVE LK-CB-PTR TO CB-PTR-DROP(LK-WINDOW-TYPE + 1)
    GOBACK.

END PROGRAM SetCallback-WindowDrop.

*> --- GetCallback-WindowDrop ---
IDENTIFICATION DIVISION.
PROGRAM-ID. GetCallback-WindowDrop.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-CALLBACKS.
LINKAGE SECTION.
    01 LK-WINDOW-TYPE               BINARY-LONG.
    01 LK-CB-PTR                    PROGRAM-POINTER.

PROCEDURE DIVISION USING LK-WINDOW-TYPE LK-CB-PTR.
    IF LK-WINDOW-TYPE < 0
        MOVE CB-PTR-DROP-PLAYER TO LK-CB-PTR
        GOBACK
    END-IF
    MOVE CB-PTR-DROP(LK-WINDOW-TYPE + 1) TO LK-CB-PTR
    GOBACK.

END PROGRAM GetCallback-WindowDrop.
