*> --- Items-Count ---
IDENTIFICATION DIVISION.
PROGRAM-ID. Items-Count.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-ITEMS.
LINKAGE SECTION.
    01 LK-ITEM-COUNT            BINARY-LONG.

PROCEDURE DIVISION USING LK-ITEM-COUNT.
    MOVE ITEMS-COUNT TO LK-ITEM-COUNT
    GOBACK.

END PROGRAM Items-Count.

*> --- Items-Get-MaxStackSize ---
IDENTIFICATION DIVISION.
PROGRAM-ID. Items-Get-MaxStackSize.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-ITEMS.
LINKAGE SECTION.
    01 LK-ITEM-ID               BINARY-LONG UNSIGNED.
    01 LK-MAX-STACK-SIZE        BINARY-LONG.

PROCEDURE DIVISION USING LK-ITEM-ID LK-MAX-STACK-SIZE.
    MOVE ITEM-ENTRY-MAX-STACK-SIZE(LK-ITEM-ID + 1) TO LK-MAX-STACK-SIZE
    GOBACK.

END PROGRAM Items-Get-MaxStackSize.
