IDENTIFICATION DIVISION.
PROGRAM-ID. Main.

PROCEDURE DIVISION.
    *> To edit the configuration, run the server once ("make run") and then edit the
    *> generated server.properties file.
    CALL "Server".

END PROGRAM Main.
