IDENTIFICATION DIVISION.
PROGRAM-ID. Generated-Packets.

DATA DIVISION.
WORKING-STORAGE SECTION.
    COPY DD-PACKET-IDS.
    COPY DD-CLIENT-STATES.
    COPY DD-PACKET-DIRECTIONS.
    01 PSTATE                   BINARY-LONG UNSIGNED.
    01 PDIR                     BINARY-LONG UNSIGNED.
    01 PID                      BINARY-LONG UNSIGNED.

PROCEDURE DIVISION.
    MOVE 0 TO PACKET-ID-COUNT
    INITIALIZE PACKET-REFERENCES

$registrations:indent=4$
    GOBACK.

END PROGRAM Generated-Packets.
